# ProfileOffsetX Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ProfileOffsetX Property
ParameterTypeId Class See Also
---
"Horizontal Profile Offset"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ProfileOffsetX { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ProfileOffsetX As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ProfileOffsetX {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace